-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Sep 16, 2022 at 06:31 AM
-- Server version: 10.4.24-MariaDB
-- PHP Version: 8.1.6

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `final_product`
--

-- --------------------------------------------------------

--
-- Table structure for table `products`
--

CREATE TABLE `products` (
  `product_id` int(11) NOT NULL,
  `title` varchar(255) NOT NULL,
  `image_url` text NOT NULL,
  `description` text NOT NULL,
  `price` double NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `products`
--

INSERT INTO `products` (`product_id`, `title`, `image_url`, `description`, `price`) VALUES
(1, 'ขนมเปี๊ยะงาดำไข่เค็ม', 'https://www.img.in.th/images/2df51d58d7b3ddb886b852960a4317e5.png', 'ขนมเปี๊ยะซอย 9 ขนมอร่อยที่โด่งดังมาจากจังหวัดตรังมากว่า 20 ปี ร้านนี้ทีเด็ดคือสูตรขนมเปี๊ยะแป้งบาง กรอบของดีเมืองตรัง ไส้งาดำไข่เค็ม', 15),
(2, 'ไส้ชาเขียวไข่เค็ม', 'https://www.img.in.th/images/76c623b28b41a02420660b1409440e83.png', 'ขนมเปี๊ยะซอย 9 ขนมอร่อยที่โด่งดังมาจากจังหวัดตรังมากว่า 20 ปี ร้านนี้ทีเด็ดคือสูตรขนมเปี๊ยะแป้งบาง กรอบของดีเมืองตรัง ไส้ชาเขียวไข่เค็ม', 15),
(4, 'ขนมเปี๊ยะเผือกไข่เค็ม', 'https://www.img.in.th/images/b61eec33a7dc2deea49bd8178f0b0d46.png', 'ขนมเปี๊ยะซอย 9 ขนมอร่อยที่โด่งดังมาจากจังหวัดตรังมากว่า 20 ปี ร้านนี้ทีเด็ดคือสูตรขนมเปี๊ยะแป้งบาง กรอบของดีเมืองตรัง ไส้เผือกหอมไข่เค็ม', 15),
(5, 'ขนมจีบสังขยาไส้ไข่เค็ม', 'https://www.img.in.th/images/dc7e153c999533ec0309495823fc1a2f.png', 'ของดีเมืองตรัง ชิ้นใหญ่ ไส้แน่น หวานน้อย สูตรโบราณดั้งเดิมเป็นเอกลักษณ์ ไส้ไข่เค็ม', 20),
(6, 'ขนมจีบสังขยาไส้ใบเตยฝอยทอง', 'https://www.img.in.th/images/df45dd91f591a656d5674bf1d2850c9e.png', 'ของดีเมืองตรัง ชิ้นใหญ่ ไส้แน่น หวานน้อย สูตรโบราณดั้งเดิมเป็นเอกลักษณ์ ไส้ใบเตยฝอยทอง', 20),
(7, 'ขนมจีบสังขยาไส้เผือกหอม', 'https://www.img.in.th/images/7fcad77af011b84e6f313b88f8e6df5f.png', 'ของดีเมืองตรัง ชิ้นใหญ่ ไส้แน่น หวานน้อย สูตรโบราณดั้งเดิมเป็นเอกลักษณ์ ไส้เผือกหอม', 20),
(8, 'หมูย่างเมืองตรัง', 'https://www.img.in.th/images/d430d18b2def43c6b7c910bd0797ac82.png', 'ขึ้นชื่อว่าของดีเมืองตรัง ก็ต้องนึกถึงหมูย่าง อยากกินหมูย่างที่อร่อยก็ต้องมากินหมูย่างเมืองตรัง', 380),
(9, 'ข้าวยําน้ําบูดูเมืองตรัง', 'https://www.img.in.th/images/166e2f6f02421160f485416941cbe45c.png', 'ข้าวยำเมืองตรัง รสชาติใต้แท้ๆเลย ผักสด ข้าวหอมมัน น้ำบูดูก็ลงตัวไม่เค็มจนเกินไป ซึ่งตัวข้าวจะมีข้าวขมิ้นข้าวอัญชันและ ก็ ข้าวกล้อง ผักก็พวกถั่วงอกถั่วฝักยาวมะกรูด ข่า ตะไคร้ งา กุ้งแห้ง ผสมผสานคลุกเคล้า', 45),
(10, 'เกาหยุก', 'https://www.img.in.th/images/7f167d17e6e9e10d66d67b40d7c5079a.png', 'เกาหยุกเป็นภาษาเรียกของชาวไทยเชื้อสายจีน เป็นอาหารพื้นเมืองที่ขาดไม่ได้ ทุกงานในเมืองตรัง ต้องมีอาหารชนิดนี้ขึ้นโต๊ะ หยก หรือเกายุก ตามคำบอกเล่าของคนเก่าๆ ว่ากันว่า เกาหยุก เป็นอาหารของคนจีนกวางตุ้งที่นิยมทำกินในพิธีมงคลต่างๆเช่นงานแต่งงาน รวมไปจนถึงงานศพ  ในอดีตบ้านไหนหรือครอบครัวไหนที่ทำหมูเกาหยุกขึ้นโต๊ะอาหารเลี้ยงแขกในงาน จะถือว่าบ้านนั้นครอบครัวนั้นมีฐานะดี เพราะหมูเกาหยุกเป็นอาหารที่ทำยาก ใช้เวลานาน ต้องทำในกระทะใบใหญ่ และใช้จำนวนคนมาก', 100),
(11, 'จักสานเตยปาหนัน', 'https://www.img.in.th/images/40b536cf47b52f8e1831ec24888fbbb7.png', 'จักสานเตยปาหนัน ที่มีการพัฒนารูปแบบและลวดลายต่างๆ ออกสู่ตลาด มาอย่างต่อเนื่อง รวมถึงความภาคภูมิใจในอัตลักษณ์ที่สืบทอดภูมิปัญญาการสานเตยปาหนันมาจากบรรพบุรุษสู่ลูกหลานกว่า 100 ปี จนกลายเป็นสินค้า OTOP ที่มีชื่อเสียงสามารถสร้างรายได้แก่ชุมชนบ้านดุหุนอีกด้วย', 300),
(12, 'กระเป๋าถือผ้าทอนาหมื่นศรี', 'https://www.img.in.th/images/0ed12d9d11867d81fb9d2d36551841c8.png', 'เป็นสินค้าหัตถกรรมที่มีชื่อเสียงเป็นที่รู้จักของคนไทยมายาวนานหลายร้อยปี หลักฐานการจดบันทึกในเอกสารจดหมายเหตุ พระราชกิจรายวัน พระบาทสมเด็จพระมงกุฎเกล้าเจ้าอยู่หัว (ร. 6) ช่วงที่เสด็จประพาสหัวเมืองปักษ์ใต้ ร.ศ. 128 ได้ทอดพระเนตรผ้าทอที่เมืองตรัง สมุหเทศาภิบาลมณฑลได้ทรงจัดผ้าพรรณทุกอย่างซึ่งเป็นของทำในพื้นบ้าน เช่น ผ้ายก ผ้าราชวัตร ผ้าตาสมุก ผ้าคาด ผ้าเช็ดหน้า ถวายประทานแจกแก่ข้าราชการตามสมควร', 1000),
(13, 'หัตถกรรมไม้เทพธาโรถ้ำเลเขากอบ', 'https://www.img.in.th/images/ab85787538bb6e116c8bc1cad2806ea0.png', 'เนื่องจากรากไม้เทพธาโรจะมีมากในจังหวัดตรัง ซึ่งได้ถูกตัดทิ้งในสมัยปลูกยางพารา ไม้เทพธาราเป็นไม้มีค่า และมีประโยชน์อย่างยิ่ง คือเป็นไม้สมุนไพรที่มีกลิ่นหอม ปลวกมอดไม่กินและถือเป็นไม้มงคลชนิดหนึ่งทางกลุ่มจึงได้ขุดรากไม้เทพธาโรมาใช้ประโยชน์ดีกว่าปล่อยให้ชาวสวนเผาทิ้ง โดยนำมาเป็นผลิตภัณฑ์รูปแบบต่างๆ ด้วยวิธีการแกะสลัก และวิธีกลึง เพื่อเป็นของที่ระลึกและประดับตกแต่งบ้าน', 300);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `products`
--
ALTER TABLE `products`
  ADD PRIMARY KEY (`product_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `products`
--
ALTER TABLE `products`
  MODIFY `product_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=14;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
